#+BEGIN_HTML
---
layout: post
title: Git fork
tagline: " a valuable project"
permalink: /git/tips/how-to-fork-repository.html
categories: [git, literate programming]
tags: [tutorial, clone, remotes, fork]
---
#+END_HTML
#+OPTIONS: tags:nil num:nil \n:nil @:t ::t |:t ^:{} _:{} *:t

#+TOC: headlines 2


* Definition
  Nowadays [[https://github.com/][Git]] is a standard option to host your code and share it
  among collaborators. Seems like the best way to introduce it is to
  show how to:

  - Fork an existing repository /and obtain something useful in your
    own repo/
  - Define the remotes /you need to determine from where you want to
    push repo's updates and where to pull your changes/
  - Implement your changes /Some atomic enhancement like a typo/
  - Accomplish a pull request to the parent repository /Get a chance
    to merge your improvements with the main code/

* Documentation
  The definitive guide how-to do all meta-tasks above are at the official
  =Git= [[https://help.github.com/articles/fork-a-repo/][documentation site]].

* Fixtures

** Fork itself
   Just by pushing the button on useful project
     page. It's enough to get its fork in your
     repo.

** Clone the fork
   For illustration purposes lets fork the [[https://github.com/mikeckennedy/talk-python-transcripts][sample project]] in my own repo
   and create the local version of it:
   #+BEGIN_SRC sh :results output :exports both
   cd /usr/local/share/DVCS/
   pwd
   ls -la
   git clone https://github.com/0--key/talk-python-transcripts.git
   ls -la
   #+END_SRC

   #+RESULTS:
   #+begin_example
   /usr/local/share/DVCS
   total 28
   drwxrwsrwx 7 root   staff 4096 Dec 18 16:19 .
   drwxrwsr-x 9 root   staff 4096 Dec  7 09:50 ..
   drwxrwxrwx 9 antony staff 4096 Dec  7 09:57 0--key.github.io
   drwxr-sr-x 9 antony staff 4096 Dec  7 09:55 lib
   drwxr-sr-x 7 antony staff 4096 Jan  4 15:54 org-pub
   drwxr-sr-x 6 antony staff 4096 Dec 18 16:19 venv2
   drwxr-sr-x 5 antony staff 4096 Dec 19 20:54 venv3
   Cloning into 'talk-python-transcripts'...
   total 32
   drwxrwsrwx 8 root   staff 4096 Jan  4 15:58 .
   drwxrwsr-x 9 root   staff 4096 Dec  7 09:50 ..
   drwxrwxrwx 9 antony staff 4096 Dec  7 09:57 0--key.github.io
   drwxr-sr-x 9 antony staff 4096 Dec  7 09:55 lib
   drwxr-sr-x 7 antony staff 4096 Jan  4 15:54 org-pub
   drwxr-sr-x 5 antony staff 4096 Jan  4 15:58 talk-python-transcripts
   drwxr-sr-x 6 antony staff 4096 Dec 18 16:19 venv2
   drwxr-sr-x 5 antony staff 4096 Dec 19 20:54 venv3
 #+end_example

** Check the remotes
   #+BEGIN_SRC sh :results output :exports both
   cd /usr/local/share/DVCS/talk-python-transcripts
   git remote -v
   #+END_SRC

   #+RESULTS:
   : origin	https://github.com/0--key/talk-python-transcripts.git (fetch)
   : origin	https://github.com/0--key/talk-python-transcripts.git (push)

** Add upstream
   #+BEGIN_SRC sh :results output :exports both
   cd /usr/local/share/DVCS/talk-python-transcripts
   git remote add upstream https://github.com/mikeckennedy/talk-python-transcripts.git
   git remote -v
   #+END_SRC

   #+RESULTS:
   : origin	https://github.com/0--key/talk-python-transcripts.git (fetch)
   : origin	https://github.com/0--key/talk-python-transcripts.git (push)
   : upstream	https://github.com/mikeckennedy/talk-python-transcripts.git (fetch)
   : upstream	https://github.com/mikeckennedy/talk-python-transcripts.git (push)

** Up-to-date local version
   #+BEGIN_SRC sh :results output :exports both
   cd /usr/local/share/DVCS/talk-python-transcripts
   git fetch upstream
   #+END_SRC

   #+RESULTS:
   : From https://github.com/mikeckennedy/talk-python-transcripts
   :  * [new branch]      master     -> upstream/master

** Merge the local branches
   #+BEGIN_SRC sh :results output :exports both
   cd /usr/local/share/DVCS/talk-python-transcripts
   git merge upstream/master
   #+END_SRC

   #+RESULTS:
   #+begin_example
   Updating 1285b80..a3be58a
   Fast-forward
    transcripts/007.txt |   2 +-
    transcripts/009.txt | 173 ++++++++++++++++++-
    transcripts/016.txt | 405 ++++++++++++++++++++++++++++++++++++++++++++-
    transcripts/039.txt | 170 ++++++++++++++++++-
    transcripts/041.txt | 155 ++++++++++++++++-
    transcripts/060.txt |   2 +-
    transcripts/061.txt |   2 +-
    transcripts/072.txt |   1 +
    transcripts/073.txt | 263 +++++++++++++++++++++++++++++
    transcripts/074.txt | 304 ++++++++++++++++++++++++++++++++++
    transcripts/075.txt |   1 +
    transcripts/076.txt | 404 +++++++++++++++++++++++++++++++++++++++++++++
    transcripts/077.txt | 468 ++++++++++++++++++++++++++++++++++++++++++++++++++++
    transcripts/078.txt | 276 +++++++++++++++++++++++++++++++
    transcripts/079.txt |   1 +
    15 files changed, 2620 insertions(+), 7 deletions(-)
    create mode 100644 transcripts/072.txt
    create mode 100644 transcripts/073.txt
    create mode 100644 transcripts/074.txt
    create mode 100644 transcripts/075.txt
    create mode 100644 transcripts/076.txt
    create mode 100644 transcripts/077.txt
    create mode 100644 transcripts/078.txt
    create mode 100644 transcripts/079.txt
#+end_example

* Results

* Conclusion
